import './footer.scss';

import Logo from '@/components/logo';
import Button from '@/components/button';

export default () => /*html*/ `
  <footer class='footer' aria-labelledby='footer-title'>
    <div class='container'>

      <div class='footer-head'>
        ${Logo({ variant: 'footer' })}

        <div class='footer-nav' aria-label='Футерна навігація'>

          <div class='footer-group'>      
            <a class='footer-link' href='#about' title='Дізнатися більше про нас'>Про нас</a>
            <a class='footer-link' href='#feedback' title='Переглянути відгуки студентів'>Відгуки</a>
          </div>

          ${Button()}
        </div>
      </div>

      <div class='seo' aria-labelledby='seo-title-1'>
        <h5 class='seo-title'>Дипломи</h5>
        <p class='seo-text'>
          Документи про освіту є важливим елементом професійної реалізації, підтвердження кваліфікації та подальшого розвитку кар’єри. Диплом засвідчує здобутий рівень освіти та спеціальність, тому питання, пов’язані з його оформленням, відновленням або перевіркою, залишаються актуальними для багатьох людей. У різних життєвих обставинах може знадобитися консультація щодо дипломів, підготовка пакету освітніх документів або роз’яснення вимог до їх використання. Компетентний підхід до цих питань допомагає уникнути помилок і заощадити час. 
        </p>
      </div>

      <div class='seo' aria-labelledby='seo-title-2'>
        <h5 class='seo-title'>Дипломні роботи</h5>
        <p class='seo-text'>
          Дипломна робота є підсумковим етапом навчання та відображає рівень знань, аналітичне мислення й уміння працювати з інформацією. Підготовка дипломної роботи потребує чіткої структури, дотримання методичних рекомендацій та академічних стандартів. Часто виникає потреба у професійній консультації щодо вибору теми, логіки викладення матеріалу, оформлення або відповідності вимогам навчального закладу. Системний підхід до роботи над дипломним проєктом дозволяє впевнено завершити навчання та ефективно використати здобуті знання на практиці.
        </p>
      </div>

    </div>
  </footer>
`;
